# Data Input and Output

* CSV
* Excel
* HTML
* SQL

In [1]:
import pandas as pd

## Read CSV

In [2]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [3]:
df = pd.read_csv('example')

In [4]:
df.to_csv('My_output', index=False)

In [5]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# CHECK

In [6]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1', index=False)

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

## Read HTML

In [7]:
data = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [16]:
len(data)

1

In [21]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [24]:
data[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [27]:
data[0]['Bank Name'].head()

0                The First State Bank
1                  Ericson State Bank
2    City National Bank of New Jersey
3                       Resolute Bank
4               Louisa Community Bank
Name: Bank Name, dtype: object

## Read SQL

In [29]:
from sqlalchemy import create_engine

In [35]:
engine = create_engine('sqlite:///:memory:')

In [36]:
df.to_sql('my_table', engine)

In [37]:
sqldf = pd.read_sql('my_table', con=engine)

In [38]:
sqldf

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15